let TP = {
    "》": {
      t: "文档",
      a: 0.5,
    },
    界面设计: {
      t: "效果图",
      a: 1,
    },
    系统图: {
      t: "效果图",
      a: 1,
    },
    UI: {
      t: "效果图",
      a: 1,
    },
    组件: {
      t: "组件",
      a: 1,
    },
    组态: {
      t: "组态",
      a: 0.5,
    },
    模型: {
      t: "设备建模",
      a: 0.5,
    },
    界面: {
      t: "效果图",
      a: 1,
    },
    建模: {
      t: "建模",
      a: 0.5,
    },
    渲染图: {
      t: "设备建模",
      a: 0.5,
    },
    效果图: {
      t: "效果图",
      a: 1,
    },
    图标: {
      t: "图标",
      a: 0.5,
    },
    原型: {
      t: "原型",
      a: 0.5,
    },
    素材: {
      t: "素材",
      a: 0.5,
    },
    贴图: {
      t: "素材",
      a: 0.5,
    },
    剪辑: {
      t: "剪辑",
      a: 1,
    },
    录屏: {
      t: "录屏",
      a: 0.5,
    },
    动画: {
      t: "动画",
      a: 2,
    },
  };
  
  module.exports = TP