var txt = `设计组晨会_202308
2023-08-25
陈峥
【昨天】《三维23Q4评审（第二次）纪要》x1、《三维Q4使用说明书》x1、《Unity场景搭建培训纪要》x1
【今日】《2024年三维产品总体规划》、《输出物度量及绩效考核》、《周报》日报转OA周报工具、《三维经营统计》

唐文洁
【昨天】资产编码规则原型x2；下午请假
【今日】资产概览原型；备品备件、对接DCOP需求评审；交互设计组周报；评审工时统计；
1 Q3自定义报表（罗烛）
2 Q3配置管理（罗烛）
3 系统支持配置查看操作日志详情（吴纤）
4 联动策略、告警（罗烛）
5 数据仓库（石银伟）
6 组态模板（林龙涵）
7 资产概览（倪伟桐）
8 Q3关联视频


赵嘉
【昨天】
【今日】

余丽 
【昨天】可视化工具1.0高保真原型x4,  Q4系统换肤&页面配置需求评审x1
【今日】可视化工具1.0高保真原型


匡原
【昨天】昌平电信修改建模x2 组态x1
【今日】国网安徽稻香路建模
待拍期
1，河北电力设备定制建模
2，云南电力设备定制建模
3，国网湖北武汉元件级定制建模
4，上海陆家嘴平安大厦
5，中国联通福建产业园

文扬思
【昨天】
【今日】


咸明阳
【昨天】国网湖北4号机房楼建筑建模x4
【今日】

2023-08-24
陈峥
【昨天】《三维23Q4评审通知》x1、《2024年三维产品总体规划》20%、《三维23Q4功能清单》x5、《三维Q4需求跟踪矩阵》x5、《三维23Q2汇报材料》x1
【今日】《三维23Q4评审（第二次）》、《三维Q4使用说明书》、《2024年三维产品总体规划》

唐文洁
【昨天】资产管理接第三方CMDB原型x4；
【今日】资产编码规则原型；


赵嘉
【昨天】
【今日】

余丽 
【昨天】可视化工具1.0高保真原型x6
【今日】可视化工具1.0高保真原型


匡原
【昨天】昌平电信修改建模x3
【今日】昌平电信修改建模

文扬思
【昨天】
【今日】


咸明阳
【昨天】江苏有线二期设备x4 中国铁建贵州设备x1
【今日】国网湖北4号机房楼建筑建模x4


2023-08-23
陈峥
【昨天】《TD23Q4需求规格》修改、《三维23Q4评审通知》x1
【今日】《三维23Q4评审》、《2024年三维产品总体规划》、《2024年可视化产品总体规划》、《2024年新工程组态总体规划》、数据模拟器开发调试、《23Q4功能清单》更新

唐文洁
【昨天】资产管理接第三方CMDB原型x4；增强版监控 IT设备详情、基础设施详情新增原型x2
【今日】资产管理接第三方CMDB原型；


赵嘉
【昨天】
【今日】

余丽 
【昨天】电力监控二次图元设计x14； 可视化工具1.0高保真原型 x7
【今日】可视化工具1.0高保真原型


匡原
【昨天】国网湖北电力建模x3
【今日】昌平电信修改建模

文扬思
【昨天】上海交行设备建模x3
【今日】上海交行设备建模


咸明阳
【昨天】江苏有线二期设备x3
【今日】江苏有线二期设备x4 中国铁建贵州设备x1



2023-08-22
陈峥
【昨天】《科技进步奖汇报材料》x1、《TD_Q4需求规格》、《TD_23Q4需求规格评审通知》、科技进步奖汇报、《三维23Q4评审通知》x1、《三维23Q4需求规格评审纪要》x1
【今日】《TD23Q4需求规格》修改、《三维23Q4评审通知》

唐文洁
【昨天】资产管理接第三方CMDB原型x4
【今日】资产管理接第三方CMDB原型；增强版监控 IT设备详情、基础设施详情新增原型
1 Q3自定义报表（罗烛）
2 Q3配置管理（罗烛）
3 部署工具（倪伟桐）
4 系统支持配置查看操作日志详情（吴纤）
5 联动策略、告警（罗烛）
6 数据仓库（石银伟）
7 组态模板（林龙涵）
8 资产编码规则（倪伟桐）
9资产概览（倪伟桐）


赵嘉
【昨天】湿度2.5d动态图标x3；融合组态Q4第二阶段需求预审x1; 大屏展示内容ppt x1
【今日】

余丽 
【昨天】可视化工具1.0高保真原型x6  ;  《实时告警栏需求评审》x1
【今日】电力监控二次图元设计； 可视化工具1.0高保真原型 


匡原
【昨天】国网湖北电力建模x3
【今日】 国网湖北电力建模
待拍期
1，江苏有线苏中公司
2，上海陆家嘴平安大厦
3，中国联通福建产业园
4，昌平电信修改

文扬思
【昨天】上海交行设备建模x3
【今日】上海交行设备建模


咸明阳
【昨天】国网湖北电力设备建模x4
【今日】江苏有线二期设备x3


2023-08-21
陈峥
【昨天】《设计审计检查汇报》x1、《绩效及工作量统计》x1、《版本需求决策纪要》x1、数据模拟器开发x1、《研发例会纪要》x1、演示环境组态x2、科技进步奖汇报演练
【今日】《科技进步奖汇报材料》、TDAR低保原型、《TD_23Q4需求规格评审通知》、科技进步奖汇报、三维Q3需求规格修改、三维Q4需求规格修改

唐文洁
【昨天】监控规范2.2lib组件x3、打包归档邮件通知；《交互设计组周报》x1；《评审走查工时统计》x1；
【今日】资产管理接第三方CMDB原型


赵嘉
【昨天】湿度2.5d动态图标x3；融合组态Q4第二阶段需求预审x1; 大屏展示内容ppt x1
【今日】

余丽 
【昨天】可视化工具1.0高保真原型x6  ;  《实时告警栏需求评审》x1
【今日】可视化工具1.0高保真原型


匡原
【昨天】国网湖北电力建模x3
【今日】 国网湖北电力建模

文扬思
【昨天】上海交行设备建模x3
【今日】上海交行设备建模


咸明阳
【昨天】国网湖北电力组态x1 国网湖北电力设备建模x2
【今日】国网湖北电力设备建模x4

2023-08-18
陈峥
【昨天】《三维Q4TDCE需求规格》x1、《三维Q4TDCE使用说明书》x1、《三维Q4TDCE功能清单》x1、《三维Q4TDCE版本更新记录》x1、《三维Q3测试用例评审纪要》x1、科技进步奖评审材料x1
【今日】《TD_23Q4需求规格评审通知》、TDAR低保原型、三维Q3需求规格修改、三维Q4需求规格修改、《科技进步奖汇报话术》、《设计审计检查》、《绩效及工作量统计》、《绩效面谈》

唐文洁
【昨天】监控规范2.2lib组件x10；《资产编码规则需求评审》x1；《资产概览需求评审》x1
【今日】监控规范2.2lib文件；交互设计组周报；评审走查工时统计；


赵嘉
【昨天】融合标准页面组态x4；温度2.5d动态图标x3
【今日】湿度2.5d动态图标；大屏展示内容ppt

余丽 
【昨天】字体图标x10，图标打包发布x1, 3D-空间定位2.5D图标x1，可视化工具1.0x6 ,《C50内容理平台_模板管理需求评审》x1
【今日】可视化工具1.0


匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网湖北电力建模x2

文扬思
【昨天】上海交行设备建模x4
【今日】上海交行设备建模


咸明阳
【昨天】国网湖北电力建筑建模x4； 国网湖北电力设备建模x1
【今日】国网湖北电力组态 国网湖北电力设备 


2023-08-17
陈峥
【昨天】《三维Q4TDSSR需求规格》x1、《三维Q4TDSSR使用说明书》x1、《三维Q4TDSSR功能清单》x1、《三维Q4TDSSR版本更新记录》x1、《融合组态Q4预审》x1
【今日】《三维Q4TDCE需求规格》、《三维Q4TDCE使用说明书》、《三维Q4TDCE功能清单》、《三维Q4TDCE版本更新记录》、《TD_23Q4需求规格评审通知》、TDAR低保原型

唐文洁
【昨天】监控规范2.2lib组件x15
【今日】监控规范2.2lib文件


赵嘉
【昨天】融合组态内置区块x8；极光绿素材x2
【今日】融合标准页面组态

余丽 
【昨天】可视化工具1.0高保真原型x6   暖通系统图效果图x1
【今日】融合组态字体图标，3D-空间定位2.5D图标，可视化工具1.0


匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网安徽稻香路建模

文扬思
【昨天】上海交行设备建模x3
【今日】上海交行设备建模


咸明阳
【昨天】国网湖北电力建筑建模x5
【今日】国网湖北电力建筑建模 ； 国网湖北电力设备建模


2023-08-16
陈峥
【昨天】《三维Q4TDVS需求规格》x1、《三维Q4TDV使用说明书》x1、《三维Q4TDV功能清单》x1、《三维Q4TDV版本更新记录》x1、《需求规格预审通知》x1、《出差汇报》x1
【今日】《三维Q4TDSSR需求规格》、《三维Q4TDSSR使用说明书》、《三维Q4TDSSR功能清单》、《三维Q4TDSSR版本更新记录》

唐文洁
【昨天】监控规范2.2lib组件x12
【今日】监控规范2.2lib文件


赵嘉
【昨天】极光绿默认背景x1；极光绿导航x1；科技蓝导航x1；图标x3
【今日】融合组态内置区块

余丽 
【昨天】
【今日】


匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网安徽稻香路建模

文扬思
【昨天】上海交行细节版园区新增建模x5，园区组态调整x1，设备建模x1
【今日】上海交行设备建模


咸明阳
【昨天】国网湖北电力建筑建模x3
【今日】国网湖北电力建筑建模

2023-08-15
陈峥
【昨天】三维Q4（服务器端渲染）原型x12
【今日】《三维Q4需求规格》、《三维Q4使用说明书》、《三维Q4功能清单》、《三维Q4版本更新记录》

唐文洁
【昨天】监控规范2.2lib组件x3；秦亮demo logox5；能效管理新增原型x1；博浩AI节能原型x1
【今日】监控规范2.2lib文件


赵嘉
【昨天】极光绿大屏效果图x4
【今日】极光绿主题

余丽 
【昨天】可视化1.0高保真原型设计x8
【今日】可视化1.0高保真原型设计    



匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网安徽稻香路建模


文扬思
【昨天】上海交行细节版园区新增建模x6
【今日】上海交行细节版园区新增建模，设备建模


咸明阳
【昨天】成都航空设备建模x5
【今日】国网湖北电力建筑建模


2023-08-14
陈峥
【昨天】《安徽电力需求沟通会纪要》x1，出差去程、返程、《电力客户演示话术》x1
【今日】三维Q4需求规格（服务器端渲染）

唐文洁
【昨天】增强版监控变更原型x7；《交互设计组周报》x1；《评审走查工时统计》x1
【今日】监控规范2.2lib文件


赵嘉
【昨天】极光绿主题方案x18
【今日】极光绿效果图设计

余丽 
【昨天】可视化1.0高保真原型设计x8    《Q4联动策略&告警栏&配置管理需求评审会》x1
【今日】可视化1.0高保真原型设计


匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网安徽稻香路建模

文扬思
【昨天】上海交行园区设备建模x3
【今日】上海交行细节版园区新增建模


咸明阳
【昨天】成都航空设备建模x4
【今日】成都航空设备建模


2023-08-11
陈峥
【昨天】
【今日】

唐文洁
【昨天】监控变量规范库组件x2；《监控变量规范库评审会》x1；《备份还原需求评审会》x1
【今日】增强版监控变更原型；交互设计组周报；评审走查工时统计；项目人力资源看板；


赵嘉
【昨天】北部湾定制项目全部图表配色x1；极光绿区块动画x1；按钮组设计x1
【今日】极光绿主题方案

余丽 
【昨天】可视化1.0高保真原型设计x6 ；  《监控变量规范库评审会》x1
【今日】可视化1.0高保真原型设计


匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网安徽稻香路建模

文扬思
【昨天】上海交行园区细节建模x2，园区组态x1
【今日】上海交行园区设备建模


咸明阳
【昨天】广西北部湾银行总部建模x1 组态x1
【今日】成都航空设备x4


2023-08-10
陈峥
【昨天】《三维可视化Q4需求规格》原型x2、《三维营收数据统计》x1、《设计组工作度量统计》、《3D产品工作度量统计》x1、《机柜模型方案评审纪要》x1
【今日】《三维可视化Q4需求规格》、安徽国网DEMO演示组态、《绩效目标》

唐文洁
【昨天】监控变量规范库组件x7；《增强版监控需求变更评审会》x1
【今日】监控变量规范组件；增强版监控变更原型


赵嘉
【昨天】105312 项目图标x4；《组态模板及自定义导航需求评审》x1；北部湾定制项目背景x1；区块x1；指标卡x1
【今日】北部湾定制项目全部图表配色；极光绿主题

余丽 
【昨天】请假
【今日】可视化1.0高保真原型设计


匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网安徽稻香路建模

文扬思
【昨天】上海交行园区细节建模x3
【今日】上海交行园区细节建模，园区组态


咸明阳
【昨天】广西北部湾银行总部建模x3
【今日】广西北部湾银行总部建模x1 组态x1


2023-08-09
陈峥
【昨天】出差返程
【今日】《三维可视化Q4需求规格》、《三维营收数据统计》、《设计组工作度量统计》、《3D产品工作度量统计》

唐文洁
【昨天】监控变量规范库组件x8；《资产管理接第三方CMDB评审会》x1
【今日】监控变量规范组件
1 Q3自定义报表（罗烛）
2 Q3配置管理（罗烛）
3 Q3电力图元二次图元（李晓强）
4 部署工具（倪伟桐）
5 系统支持配置查看操作日志详情（吴纤）
6 资产管理接第三方CMDB（倪伟桐）
7 联动策略、告警（罗烛）
8 数据仓库（石银伟）
9 博浩AI节能需求（陈明中）
10 3DC30空间定位图元（杜耀）
11 组态模板（林龙涵）


赵嘉
【昨天】极光绿新标题设计x1；新区块设计x1；新导航设计x1
【今日】105312  项目图标；

余丽 
【昨天】请假
【今日】


匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网安徽稻香路建模

文扬思
【昨天】上海交行园区细节建模x3
【今日】上海交行园区细节建模


咸明阳
【昨天】广西北部湾银行总部建模x2
【今日】广西北部湾银行总部建模x3


2023-08-08
陈峥
【昨天】《湖北国网展示方案》x1、《反馈处理跟踪汇报纪要》x1
【今日】出差返程

唐文洁
【昨天】监控变量规范组件x6；《数据仓库需求会议》x1；《博浩AI节能需求会议》x1
【今日】监控变量规范组件


赵嘉
【昨天】深邃蓝风格视频录屏x1；融合组态智慧园区内置区块 x9
【今日】极光绿主题设计

余丽 
【昨天】请假
【今日】


匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网安徽稻香路建模

文扬思
【昨天】上海交行园区细节建模x2
【今日】上海交行园区细节建模


咸明阳
【昨天】广西北部湾银行总部建模x3
【今日】广西北部湾银行总部建模x2



2023-08-07
陈峥
【昨天】可视化DEMO组态x4、《大屏展示内容》x1
【今日】《湖北国网展示方案》、《反馈处理跟踪汇报》

唐文洁
【昨天】增强版监控详情设计模块、台账页面变更原型x5、原型发布归档；《评审走查工时统计》x1；《交互设计组周报》x1；周六：监控变量规范组件x11
【今日】监控变量规范组件

赵嘉
【昨天】融合组态智慧园区内置区块 x10
【今日】深邃蓝风格视频录屏

余丽 
【昨天】可视化1.0高保真原型x5
【今日】


匡原
【昨天】国网安徽稻香路建模x3
【今日】 国网安徽稻香路建模

文扬思
【昨天】上海交行园区细节建模x2
【今日】上海交行园区细节建模


咸明阳
【昨天】成都航空设备建模x4
【今日】广西北部湾银行总部建模x3



2023-08-04
陈峥
【昨天】可视化DEMO组态x2
【今日】可视化DEMO组态、样例视频录制

唐文洁
【昨天】增强版监控详情设计原型x5；监控同步原型x1；秦亮demo首页搭建原型x1
【今日】增强版监控详情设计模块、台账页面变更、原型发布归档；评审走查工时统计；交互设计组周报
1 Q3自定义报表（罗烛）
2 Q3配置管理（罗烛）
3 Q3电力图元二次图元（李晓强）
4 部署工具（倪伟桐）
5 系统支持配置查看操作日志详情（吴纤）
6 能效容量规范变量设计（李景正）
7 资产管理接第三方CMDB（倪伟桐）
8 联动策略、告警（罗烛）

赵嘉
【昨天】融合组态机房监控区块x2；2.5d动画图标x3；编辑态新增图标x2；
【今日】融合组态智慧园区内置区块

余丽 
【昨天】纵向选项卡效果图、组件x1、《Q4联动策略&告警栏需求评审》x1、TDC30-TDCV设备面板图元x12
【今日】可视化1.0高保真原型


匡原
【昨天】上证技术大厦建模x2，首页3D渲染图x1
【今日】 国网安徽稻香路建模

文扬思
【昨天】上海交行园区细节建模x2，电力柜组态编辑规范x1
【今日】 上海交行园区细节建模


咸明阳
【昨天】成都航空设备建模x4
【今日】成都航空设备建模x4



2023-08-03
陈峥
【昨天】《三维产品运营分析报告》80%、可视化DEMO组态x1
【今日】可视化DEMO组态

唐文洁
【昨天】增强版监控详情设计、表单原型x6；《资产管理接第三方CMDB评审会》x1
【今日】增强版监控详情设计模块、监控同步页面变更、台账页面变更；秦亮demo首页搭建

赵嘉
【昨天】融合组态机房监控内置区块x11
【今日】融合组态机房监控内置区块

余丽 
【昨天】可视化1.0高保真原型x5、《系统支持配置查看操作日志详情需求评审》x1、《DCOP需求评审会》x1
【今日】纵向选项卡效果图、组件、《Q4联动策略&告警栏需求评审》、TDC30-TDCV设备面板图元 


匡原
【昨天】共济苏州园林细节建模x3
【今日】上证技术大厦首页3D渲染图

文扬思
【昨天】湖北电网47u机柜、47u机柜高模建模修改x2，微模块建模修改x4
【今日】上海交行园区细节建模，电力柜组态编辑规范


咸明阳
【昨天】成都航空设备建模x5
【今日】成都航空设备建模x4



2023-08-02
陈峥
【昨天】《三维可视化C50需求规格》40%，低保真原型x2、《数据分析需求评审纪要》x1、《团队季度PBC》x1
【今日】《三维可视化C50需求规格》、《三维产品运营分析报告》

唐文洁
【昨天】增强版监控详情设计、表单原型x6；demo首页切图x1
【今日】增强版监控详情设计、表单设计；资产管理对接第三方CMDB需求评审

赵嘉
【昨天】融合组态内置区块新增2.5d动态x6；动态图片x3；图标x4
【今日】融合组态机房监控内置区块

余丽 
【昨天】浦发银行设备图标x2、交通银行地图x2、字体图标更新x30、字体图标打包发布x1
【今日】可视化1.0高保真原型、《短信电话页面设计需求评审》、《DCOP需求评审会》


匡原
【昨天】共济苏州园林细节建模x3
【今日】共济苏州园林细节建模

文扬思
【昨天】上海交行园区细节建模x3
【今日】湖北电网47u机柜、47u机柜高模建模修改x2，微模块建模修改x4

咸明阳
【昨天】成都航空设备建模x5
【今日】成都航空设备建模x5



2023-08-01
陈峥
【昨天】《三维可视化C50需求规格》、原型x2
【今日】《三维可视化C50需求规格》、《数据分析需求评审纪要》、《团队季度PBC》


唐文洁
【昨天】导入导出高保真原型x7、《湖北国网需求会》x1、《能效容量规范变量会》x1；
【今日】增强版监控详情设计、表单设计

赵嘉
【昨天】融合组态深邃蓝图表方案x22
【今日】融合组态基础监控内置区块

余丽 
【昨天】多语言切换APPx2、《物联定位UI测试报告》x1
【今日】浦发银行设备图标、交通银行地图、字体图标更新、字体图标打包发布


匡原
【昨天】开发用第一人称模型，配合开发修改及新增平衡车，机械臂部件x2
【今日】共济苏州园林细节建模

文扬思
【昨天】天威福田展厅视频剪辑修改x1，昌平电信电力元件建模x4
【今日】上海交行园区细节建模

咸明阳
【昨天】成都航空设备建模x5
【今日】成都航空设备建模x5



`;
getweekreport(txt);

function getweekreport(txt) {
  let date_scope = getDateScope();
  // var txt = this.value;

  // 最终结果的对象
  let resultObj = {};

  // 人员列表
  let staffReg = new RegExp(/陈峥|匡原|唐文洁|文扬思|咸明阳|余丽|赵嘉/gi);

  // 晨会表头
  const meeting_th = ["人员", "任务", "输出物", "标准工时"];

  // 日期表达式
  let dateReg = new RegExp(/\d\d\d\d-\d\d-\d\d/gi);

  //任务分隔符
  let taskReg = new RegExp(/、|，|；|\s/gi);

  //工作量分隔符
  let loadReg = new RegExp(/[x|×]/gi);

  // 项目列表
  let projs = {};

  // 文本转化成数组
  let txtArr = txtTransform(txt);

  let TP = {
    "》": {
      t: "文档",
      a: 0.5,
    },
    界面设计: {
      t: "效果图",
      a: 1,
    },
    系统图: {
      t: "效果图",
      a: 1,
    },
    UI: {
      t: "效果图",
      a: 1,
    },
    组件: {
      t: "组件",
      a: 1,
    },
    组态: {
      t: "组态",
      a: 0.5,
    },
    模型: {
      t: "设备建模",
      a: 0.5,
    },
    界面: {
      t: "效果图",
      a: 1,
    },
    建模: {
      t: "建模",
      a: 0.5,
    },
    渲染图: {
      t: "设备建模",
      a: 0.5,
    },
    效果图: {
      t: "效果图",
      a: 1,
    },
    图标: {
      t: "图标",
      a: 0.5,
    },
    原型: {
      t: "原型",
      a: 0.5,
    },
    素材: {
      t: "素材",
      a: 0.5,
    },
    贴图: {
      t: "素材",
      a: 0.5,
    },
    剪辑: {
      t: "剪辑",
      a: 1,
    },
    录屏: {
      t: "录屏",
      a: 0.5,
    },
    动画: {
      t: "动画",
      a: 2,
    },
  };

  // 文本处理
  dataMine();

  genWeekreport();

  function genWeekreport() {
    let report = [];
    date_scope.forEach((date) => {
      if (resultObj[date]) {
        let task_txt = "";
        resultObj[date]["陈峥"].forEach((task) => {
          task_txt += task[0] + "; ";
        });
        report.push(`${date}: ${task_txt}`);
      }
    });

    console.log(JSON.stringify(report));
    //   return report;
  }

  // 处理文本变成数组
  function txtTransform(txt) {
    // 去掉段内换行
    txt = txt.replace(/\r|\u0085|\u2028|\u2029/gi, "");

    // 切成数组
    let arr = txt.split(/\n/);
    arr.forEach((str, i) => {
      // 去掉今日
      arr[i] = str.replace(new RegExp("【昨天】", "g"), "");
      if (/【今日】/.test(str) || !str) arr.splice(i, 1);
    });
    return arr;
  }

  function dataMine() {
    let dt, person, taskArr, loadArr;
    txtArr.forEach((str) => {
      //说明是日期行
      if (dateReg.test(str)) {
        resultObj[str] = {};
        dt = str;
      }

      // 说明是人员行
      if (staffReg.test(str)) {
        person = str.replace(/\s/g, "");
        resultObj[dt][person] = [];
      }

      // 说明是任务行
      let projName = "";
      if (loadReg.test(str)) {
        taskArr = str.split(taskReg);
        taskArr.forEach((task, i) => {
          loadArr = task.split(loadReg);
          if (/%/.test(loadArr[1])) return false;
          if (!loadArr[1]) return false;

          for (const key in TP) {
            if (new RegExp(key).test(task)) {
              resultObj[dt][person].push([
                task.replace(/\s/g, ""),
                TP[key].t,
                TP[key].a * parseFloat(loadArr[1]),
              ]);

              return;
            }
          }
        });
      }
    });
  }

  function getDateScope() {
    let date_scope = getLatest();
    let now_day = new Date().getDay();
    let len = 0;
    // 从今天到上个周一

    if (now_day <= 5) {
      // 如果没到周五
      len = now_day;
      date_scope = date_scope.slice(7 - len);
    } else {
      // 到周五
      len = 5;
      date_scope = date_scope.slice(0, 5);
    }
    return date_scope;
  }

  function getLatest() {
    // 创建一个空数组来存储日期
    let dates = [];

    // 获取当前日期
    let now = new Date();

    // 循环获取最近 7 天的日期
    for (let i = 0; i < 7; i++) {
      // 获取当前日期的时间戳
      let timestamp = now.getTime();

      // 计算 i 天前的时间戳
      let dayTimestamp = 24 * 60 * 60 * 1000; // 一天的毫秒数
      let iDayAgoTimestamp = timestamp - i * dayTimestamp;

      // 转换为日期对象
      let date = new Date(iDayAgoTimestamp);

      // 格式化日期为 "yyyy-MM-dd" 的字符串并存入数组
      let year = date.getFullYear();
      let month = ("0" + (date.getMonth() + 1)).slice(-2);
      let day = ("0" + date.getDate()).slice(-2);
      dates.push(year + "-" + month + "-" + day);
    }

    // 打印日期数组
    // console.log(dates);
    dates.reverse();
    return dates;
  }
}
