{"wArr":[11,8,42.8125],"twArr":[64.8125,52.8125,43.8125],"maxlv":3,"topicArr":[{"id":"a3psv9hkjo132e136919ti92bb","state":"open","txt":"序言一、顾淑林","pid":"canvas"},{"id":"hegojzt5eaabx8mj7uqezfd4gt","state":"open","txt":"有关自主创新，路风先生的第一个贡献，是在反复的对比论证中强调自主创新必须成为我国发展战略的出发点和核心内容。","pid":"a3psv9hkjo132e136919ti92bb"},{"id":"fsfgd5nqvzugbxbblruetqg9pj","state":"none","txt":"路风的研究围绕着一个命题，就是自主创新。路风的杰出贡献在于：他揭示了在改革开放和新的国际环境下，即贸易与生产的全球话以及在WTO设置的全球贸易和技术转移的规则框架之下，为什么中国一定要自主创新和如何自主创新。","pid":"hegojzt5eaabx8mj7uqezfd4gt"},{"id":"5g8jmxghm59wa6nax6fnmbzp83","state":"none","txt":"中国虽然保持了近40年的高速增长，但是这个高速增长的后面，是中国很多核心技术还不掌握，在全球价值链中处在中游向上游攀登的过程。","pid":"hegojzt5eaabx8mj7uqezfd4gt"},{"id":"musvh283oyf4aox8y7ebfp7bfs","state":"none","txt":"路风用大量的示例告诉我们技术可以买到，而技术能力是买不到的。因为技术能力是有目的的主动学习的结果，而自主创新为这种主动地学习设定目标，搭起积累知识与能力的平台。技术能力是在自主创新的实践中通过解决具体问题形成的，它的很大部分属于zhen默的知识，它蕴藏在企业和企业网络的组织结构和运作常规中间。当然，如此品质的技术能力是没有地方能够买到的。","pid":"hegojzt5eaabx8mj7uqezfd4gt"},{"id":"bie1vljfb9zhqk91nwfw58lfsj","state":"none","txt":"路风先生严厉地批评“比较优势论”。这是从发展战略角度的批评，是完全必要的。在战略思维上锁定到（静态）比较优势，就是把国家和民族的命运锁定到永远落后。读者要注意，战术问题与战略问题是两个不同层面的问题。在战略上批评比较优势，不等于在战术上不要精心的地用好现时的比较优势，获得生存的基础。","pid":"hegojzt5eaabx8mj7uqezfd4gt"},{"id":"lykkrih6ii4etx9ztyi78nr2h2","state":"none","txt":"因此从战略的角度，发展中国家相对低成本的劳动优势的本质含义，是以比较低的人力成本发展出接近发达国家技术能力的潜在可能性。更重要的是，这种潜在的优势一定要有目的地开发出来才能变成真实的优势，而且这种潜在优势的开发还具有时限性，我们必须不失时机地用好它。","pid":"hegojzt5eaabx8mj7uqezfd4gt"},{"id":"pzugskk2644xwk3s2ssb2wbbe3","state":"open","txt":"路风先生的第二个贡献是非常详实地探讨了如进行自主创新的问题。","pid":"a3psv9hkjo132e136919ti92bb"},{"id":"kd1wh789rdsn3yp8sexxanebzq","state":"none","txt":"路风先生论证了建构技术创新，在有些情况下称作集成创新，是后发展国家技术创新的重要创新方式。","pid":"pzugskk2644xwk3s2ssb2wbbe3"},{"id":"aqwwubbppuk9os294bao6zmv5l","state":"none","txt":"1990年两位美国教授跑出来对美国的企业家说，你们要小心了，你们原创的技术优势已经不能保证你们额高枕无忧地赚大钱了。外来竞争者可能在你们不经意间摧毁你们的竞争优势，它们的武器是建构技术创新。","pid":"pzugskk2644xwk3s2ssb2wbbe3"},{"id":"n8e4ys53w4rb8ltbysnht7go25","state":"none","txt":"因为在一定的创意（建构创新）下，创新者不必要样样事情从头做起，已经有的技术组件可以使得具有新功能的产品迅速从创意走向市场。建构技术创新和集成技术创新使得已有技术的生命周期缩短，竞争性新技术可能在已有技术的垄断者没有察觉或者无暇顾及的时候出现。","pid":"pzugskk2644xwk3s2ssb2wbbe3"},{"id":"l85kzsfn9evmm663isrzg12414","state":"none","txt":"路风先生在中国的实践中挖掘出来土生土长的经验，及其有利的向国人指出，自主创新是有可能实现的，它的一条重要途径就是建构技术创新。（作者举了VCD\/DVD）的例子。进行建构技术创新要求的能力结构和遇到的瓶颈，例如配套能力的缺失和创新系统弥补缺失能力的效率的低下，是典型的欠发达创新系统的弱势，揭示出创新政策需要注意的方向。","pid":"pzugskk2644xwk3s2ssb2wbbe3"},{"id":"mrt4og9nf2wh8gg5pob8dbyagf","state":"none","txt":"本书还讨论了才有发动机燃油系统的创新。创新研究者有时还称之为转型技术创新，是在一个技术路径已经建立、而技术的某个关键部分发生不连续变化的创新。路风先生的工作告诉我们，在技术面临转型的关头，虽然竞争的压力更大，后发企业也有机会开发出独特的技术路径。由于技术的复杂性和相互关联的性质，后发企业在技术转型的时期，通过依托本国已经初步形成的技术系统加上主动地创造性的努力，开辟出独特的技术路径是可能的。","pid":"pzugskk2644xwk3s2ssb2wbbe3"},{"id":"dqs632ferqjifrxiuie5pmqgx9","state":"none","txt":"路风还探讨了另外两种模式的创新的形式，一是在设计在国家经济、国防等重大利益且自然垄断效应极强的领域的创新，这些领域的创新常常从公共领域起步，本书为此呈现的是大飞机案例；二是在网络效应极强的通信领域，在国家主管部门与企业的互动当中发展系统标准的自主创新。政策的作用在于创造规范的市场竞争环境，改善支持和协调功能，这两类创新都与政府的决策和公共资金的投入有着直接的关系，战略层面一个有作为的政府对待这些自主创新的机会，政府如果要做决定，还需要更加详尽的政策分析工作。","pid":"pzugskk2644xwk3s2ssb2wbbe3"},{"id":"5igoev4bpk4huza3thgvtrtt1m","state":"open","txt":"路风先生着力分析了产品创新的要件如下。","pid":"a3psv9hkjo132e136919ti92bb"},{"id":"j564eadag6q6dv8pbd5j8o7rg6","state":"none","txt":"其一、与过程创新不同，产品创新所开辟的是新的”技术路径”，","pid":"5igoev4bpk4huza3thgvtrtt1m"},{"id":"oaijwo9plz1rpe3g7bsd75yeog","state":"none","txt":"其二、本土市场需求是从事自主产品创新不可或缺的资源。从事自主产品创新的关键是企业家敏锐洞察市场需求并把他变成新产品的构想，而本土企业家具有了解本土需求的不可比拟的优势，本书提到的数字视频播放机的创新应该不是特例。","pid":"5igoev4bpk4huza3thgvtrtt1m"},{"id":"t214fhqn52i2y4sq6tuky8rywb","state":"open","txt":"不难看出，上述几种路风先生集中讨论的自主创新模式是与广泛流传的“模仿创新”是针锋相对的。中国为什么不能走模仿创新的路线。","pid":"a3psv9hkjo132e136919ti92bb"},{"id":"v7u6w9j9z9u3n95uhba39alvtx","state":"none","txt":"也就是说，引进外国技术，通过反向工程的强化学习，一步一步跻身到已有技术的前沿。从技术路径的概念来理解模仿创新，模仿创新进入的是已经建立的技术路径；从能力结构的角度看模仿创新，模仿创新是从已获得生产能力逆向爬升到获得产品设计能力。","pid":"t214fhqn52i2y4sq6tuky8rywb"},{"id":"owqbbl4698mx4r5fautxtzaeni","state":"none","txt":"而路风先生为之争辩的自主产品创新，它们开辟的是新的技术路径，在能力结构方面，它们必须从产品设计开始。","pid":"t214fhqn52i2y4sq6tuky8rywb"},{"id":"65gpndwyotb676kewx54ijg1bq","state":"none","txt":"1、第一，中国面临的发展环境与上世纪南韩和亚洲四小龙的起步年代大不相同。一方面，WTO大大提高了模仿创新的成本；新的环境特点就是供模仿创新的空间缩小了；另一个方面，大体开放的国际技术市场的确提供了越来越多种多样的供应资助产品创新的技术构件,自主产品创新的机会增多，这还不仅仅是因为技术条件的比较开放，还因为中国在技术和经验的积累上更丰富更多样化。","pid":"t214fhqn52i2y4sq6tuky8rywb"},{"id":"a3w5tb5jx8svm6hgd63bxqpx1a","state":"none","txt":"2、第二，外向型发展战略是基于亚洲四小龙的经验概括的，明显的不适合发展中大国。那样一个国际市场，它负担得起小型经济的起飞，但是很难承担的起发展中大国起飞需要的支持力。","pid":"t214fhqn52i2y4sq6tuky8rywb"},{"id":"xr5xmd71ykw3upub6gzfnovqqi","state":"none","txt":"3、第三，我国是一个具有13亿人口的大国，国内有庞大的市场，具有本土市场需求这个从事自主产品创新不可或缺的资源，完全承担的起国内企业自主研发的市场，并且更需要本土企业家了解本土需求并基于具体问题上的自主开发。","pid":"t214fhqn52i2y4sq6tuky8rywb"},{"id":"pmbbvo84y8m6wpi8knd11m95jn","state":"open","txt":"","pid":"a3psv9hkjo132e136919ti92bb"},{"id":"bf8aqgozb11kwy4tjr383b4j1m","state":"none","txt":"创新研究的一般结论是产品创新与过程创新相辅相成。    加假如过程创新的本土技术供应能力不足，而且需要的技术和手段有主要从外国厂商手里买来，那么仅仅进行过程创新——即用1越来越先进的设备扩大中国制造，必然的结果就是“资本驱逐劳动”的效应落实在本国，增加的与机器设备相关的高端工作与学习机会则提供给了技术的供应国。","pid":"pmbbvo84y8m6wpi8knd11m95jn"},{"id":"s2phdid1vru5um7zfayrb2bxby","state":"none","txt":"在实际操作中，我们不能把模仿创新排除出去。在许多传统技术领域，模仿创新是主要的创新途径。","pid":"pmbbvo84y8m6wpi8knd11m95jn"},{"id":"4ukl6i68wb6k25e44bp647nv5j","state":"open","txt":"路风先生的第三个贡献是对时下普遍存在的消极被动地依赖外国技术这一病态现状的分析诊断。","pid":"a3psv9hkjo132e136919ti92bb"},{"id":"e98b99pmvgumzysp5n85dklfr4","state":"none","txt":"政策上，中国在计划经济年代形成了一套技术引进、零部件国产化的做法。在技术变化缓慢的领域和受到保护的国内市场上，在一定程度上曾经是可行的，但是效率不高。这套办法用在改革开放年代，先是在信息技术领域行不通了。具体体现在：1、磁带录像机的全方位技术引进项目，还没等到生效即已经过时。2、柴油机的喷油控制技术，一旦技术轨道发生不连续变化，国内原有的技术积累和创新机制就显得力不从心，没有能力应对。      由于放弃了自主创新，在开放的环境下一步一步滑向躺到外国技术（通常是陈旧的外国技术）身上，最后丧失掉已经初步积累的技术能力和出卖进行自主创新实体的“路径”。","pid":"4ukl6i68wb6k25e44bp647nv5j"},{"id":"kku5fx9edij4a5xkx29inxrebu","state":"none","txt":"我们必须避免口头上表了态度而在行动中”穿新鞋走老路“。习以为常的行为方式和制度结构已经存在了好多年，与自主创新的要求相去甚远。自主创新的组织与文化只有在做的过程中、在实践当中发展出来，绝不是中央一纸命令就能解决的。","pid":"4ukl6i68wb6k25e44bp647nv5j"}]}