{"wArr":[11,11,11],"twArr":[36,24,12],"maxlv":3,"topicArr":[{"id":"u62rsjoeoz5b5bzdgegx4bwkzp","state":"open","txt":"女人最喜欢和最讨厌的话","pid":"canvas"},{"id":"khz2nqjv8gyjtb5uwdzol4fzu2","state":"open","txt":"女人最喜欢听的话","pid":"u62rsjoeoz5b5bzdgegx4bwkzp"},{"id":"wp2hfh6jeg264a14kllbhsr4sx","state":"none","txt":"在比较特别的日子里，比如女人的生日、情人节等，你可以给女人一个惊喜，送她一份小礼物。此时，如果你能加上一句“我爱你” 对女人的杀伤力会比你想象的还要厉害，\n我会让你一生都幸福和快乐，我要一辈子好好地照顾你，体贴你。”这话真让人陶醉。如果你在对女人求婚时说出这样的话，放心，她绝对不会拒绝你！女人都希望男人能够给她们这样的承诺，\n“我们去散散步吧，就我们两个人。” 这话表示你想和她单独在一起，会觉得自己在你心中非常重要\n“认识你的那一天是我一生中最美好、最重要的日子！ ” 这番话可以减少她对感情的疑虑，帮助她建立信心。\n“娶到你这样的好老婆，我真是幸运死了！ ” 男女关系需要滋润才能成长，经常这样赞美她，可以令她觉得你们正是天造地设的一对。\n“如果没有你，我真不知道该怎么办。”这是让她知道，你需要她，\n我来做吧。” 在说这话的时候，如果再配合上行动，表示你愿意分担负担，协助打扫、洗碗等工作，女人会觉得你是个负责任的男人。\n我喜欢看你的眼睛。” 女人都喜欢自己的外表有特点，赞扬她的外表也能加强你们之间的关系。\n“你真是越来越漂亮了！ ” 不论什么时候，夸奖女人漂亮都不会是错误的事情\n“没什么事，就想昕昕你的声音。”女人是很难抗拒你这样的甜言蜜语的\n“有人说我花心，我承认；但自从遇到你以后，我对其他女人一点兴趣都没有，我发现我真正找到了真爱。”女人都希望自己是特别的，与众不同的，当你对她这样说的时候，她一定非常心动。\n“你不爱我没关系，但即使这样我也会一生保护你的。只要你需要我，我随时都会到你面前。”男人对他求之不得的女人恳切地说，女人昕了这样的话，即使不会心动，也会被感动得一塌糊涂。\n“不管将来发生什么事，你变成什么样子，你永远是我最爱的人。”痴情的男人在花前月下向女朋友说着伟大誓言，女人一般都会当作是真的。\n不知道为什么，和你一起总会令我忘记时间存在。”明明已经整天结伴，男人送女人到家门时，依旧一脸依依不舍地说。想必此时的女人昕了一定是心花怒放。\n“现在能够见面多好啊！ ”一天甜蜜约会结束，凌晨时分，男的还捧着电话筒向远方的她充满渴望地说，\n不论在任何时f民、任何情况下，只要你还需要我，我会马上赶到你身边，尽我最大的努力为你做事c ”当女友提出分于，男人依旧一脸痴痴地对女人说，只是不知道女人是否还能够回心转意，但男人知道的是，女人一定爱听这种男人愿意为她赴溺蹈火的话。\n此刻我很挂念你，请为我小心照顾自己。”男人出差在外仍不忘发短信给女友留下动人的话，女人则一定是甜蜜得要死。\n我从来不会对任何一个女人许下诺言，也从不会对任何一个女人做我会为你所做的事，你在我心目中是多么的不同！ ” 聪明的男人会这样对爱嫉妒的女人说，这会使女人产生这样的感觉，她是你心中惟一的－ 位。\n我答应不会让任何人伤害你，包括我自己在内，相信我！我会给你幸福 ”女人在工作或人事上受到委屈，男人把她一拥入怀，体贴地一番耳语c 此时，相信女人心中所有的不快都会烟消散。\n“能和你结婚的人一定是最幸福的。”在第一次约会时，男人向暗恋已久的女孩含蓄地说，你肯定已经看到她羞红的面颊了，其实这话她很受用。\n“你在我心中，永远是最有气质、最特别和最具吸引力的女孩。” 男人轻抚女友秀发，深情地说。不论在任何时候，任何环境，对任何对象，说这句话必定百发百中c\n女人爱昕的话很多，总之，都是离不开甜言蜜语。男性朋友们，如果你打算追到心仪的女孩子，就不要再吝惜自己的甜言蜜语了，找机会多对她说一些，即使她不会马七接受你，也会被你的好话打动的","pid":"khz2nqjv8gyjtb5uwdzol4fzu2"},{"id":"olxadmxbno5vj4j42i86emkxbq","state":"open","txt":"女人最讨厌的话","pid":"u62rsjoeoz5b5bzdgegx4bwkzp"},{"id":"bemos5ua3kablph2go7pdntjw1","state":"none","txt":"“我当年……” 在与女人交往时， 一些男人可能经常这样说，提起过去就两眼发亮的男人，明摆着是现在信心不够\n“你这是怎么搞的？我早就知道这不行了c” 往往是自卑感的另一种表现\n“不信咱们打赌！这就证明他根本就没有把握赢，因为他们更容易相信侥幸\n“这顿饭还是我请吧！谁跟我争我跟谁急！ ” 说这话的男人，在女人眼里是一种很小气的男人\n“没问题，我能修好你一定要先问间自己是否真的能修好，如果修不好，那会失掉男子汉尊严的。女人不在乎你是否真有这样的本事，她更希望你坦城一些。\n“我没事儿。”悲伤、沮丧的感觉，男人也会有。可是男人们却往往害怕暴露自己的软弱，哪怕是对自己最亲近的人，也要佯装坚强。其实这并不是聪明的做法、即使你只是想给女人留下一个坚强的印象，但女人可能会觉得是你不够信任她，不愿意对她说实话。\n“我是一个不修边幅的人，别指望我打扮给你看。”男人们往往会愚蠢地以为， 只有通遏的样子才会显得有男子气。其实越来越多的女人在担心，过于不修边幅的男人一定是懒惰而又缺乏自尊的男人。\n“我是……最棒的吧？ ” 面对男人们这样的话，女人会感到\n很为难。如果如实相告，难免会挫伤他的自尊心，但即使违心恭维一番，也不会带来好结果\n“朋友如手足，女人如衣服。” 说这话的男人肯定是不打算有好日子过了，她会很直接地告诉你：“那么你以后就跟你的朋友过吧！ ” 然后远远地离开你，让你后悔莫及。","pid":"olxadmxbno5vj4j42i86emkxbq"}]}