{"wArr":[11,11,11,11],"twArr":[48,36,24,12],"maxlv":4,"topicArr":[{"id":"bblukzt6lr2rfm7wfpfsleq1th","state":"open","txt":"女人爱上男人的信号","pid":"canvas"},{"id":"vi4rbkuypwpq8hx7q8pfyvrwjp","state":"open","txt":"女人爱上男人时的语言","pid":"bblukzt6lr2rfm7wfpfsleq1th"},{"id":"wzb9k3obm8e5qm2zb8e65g7ygo","state":"open","txt":"单独与你说再见","pid":"vi4rbkuypwpq8hx7q8pfyvrwjp"},{"id":"w42684h36f5q4m97rjvipjmavn","state":"none","txt":"每天下班的时候， 她走的时候总是有意无意地单独与你说声“ 再见” ，并始终对你微笑着。\n而在某次聚会要散的时候，某个女孩单独对你说：‘很高兴认识你，可我不得不现在就走。”如果你回答她：“哦，好的，我也很高兴认识你，再见。”这样女孩也会失望的。其实她要表达的意思是：“在这个聚会中我最中意你，但我的朋友要走了，我也得走了。现在你该向我要电话号码了。”\n而如果她对你说再见的时候，你担心她没有别的意思，可以先将自己的电话或名片给她这样不仅免去了被她拒绝的尴尬，也会让\n她觉得你是一个很坦率的人。女人大多都比较欣赏这种坦率的男人","pid":"wzb9k3obm8e5qm2zb8e65g7ygo"},{"id":"kyhdexfi5nnoz7simmo1yltt4b","state":"open","txt":"挖空心思制造偶然","pid":"vi4rbkuypwpq8hx7q8pfyvrwjp"},{"id":"l2sbk2zw2op44zl86qkw2vifbr","state":"none","txt":"如果你经常会在不经意间遇到某一个女人，比如经常在同一班车\n相遇，或者经常在咖啡厅喝咖啡的时候碰见她，等等。也许你因此会认为这是命运的安排，是缘分让你们这样相遇的。其实，很大一部分原因是她对你有好感，是她在故意制造‘ 偶然” ，增加你们的见面机会。\n如果你经常在偶然的情况下与同一个女人相遇，而对方却又没有表示出警戒的话，那么这种安排的可能性很高。","pid":"kyhdexfi5nnoz7simmo1yltt4b"},{"id":"thub37i3x5kqlhegi685ofstui","state":"open","txt":"经常向别人打昕你的情况","pid":"vi4rbkuypwpq8hx7q8pfyvrwjp"},{"id":"f35yno6vpofhziwbiu6ptqifx2","state":"none","txt":"如果一个女人经常通过别人打昕某一个男人的情况，那\n么就不是单纯的好奇心了，大多数是因为她对这个男人产生了关心。而这种关心则是对他默默倾注情感的表现。\n她也会直接有意无意地问你“ 昨天怎么没来上班” 或者“你今天理发了” ？对于这些问题，我们可以认为是同事般的关心，但也不能否认它可能是女人在对你表达爱意。判断的方法就要看她对你说话的语气了。细心的男性朋友，这点你要留心察觉－ 下。\n除了向其他人打昕你，\n自己也会采取一些含蓄的方式试探你。比如她会找借口问你，什么时候请她吃喜糖，以此来判断你是否有恋爱对象。如果昕你说还不知道猴年马月呢，那么她的眉宇之间就会露出如释重负的神态。这些细微的神情变化，也多半是她心里萌动的爱情征兆。\n如果一个女人对你没意思，她是犯不着去了解有关你的事的","pid":"thub37i3x5kqlhegi685ofstui"},{"id":"byzqsavlsjl7nrlx18i7y4x68u","state":"open","txt":"突然莫名其妙的疏远你","pid":"vi4rbkuypwpq8hx7q8pfyvrwjp"},{"id":"27sv4on89qywlb6mp93ojbsupk","state":"none","txt":"没有平时对你很好的某个女人突然对你疏远起来，而你也没有做什么错事得罪她。如果真有的话，那么要恭喜你，这也许并不完全是坏事，因为，这可能是她喜欢上你的信号。\n如果男女两个人在别人面前故意疏远，并不一定是他们真的有矛盾了，而很可能是在掩饰他们的感情c\n如果正与你交往的女性，突然莫名其妙地对你疏远起来，甚至对你摆出一副爱理不理的态度，或者故意与你找茬，拒绝和你直接接触，如果你们之间没有出现什么其他矛盾的话，那么你就应该意识到，这可能是她已经对你有好感，或者已经喜欢上你了。而她这样做，也许是怕给别人落下话柄，因此才这样故意疏远你的。\n如果她真的讨厌你的话，那她往往会在表面上对你大献殷勤，因为一般女人都想隐瞒自己对他人的真实感情，不想被别人看出自己的心事。","pid":"byzqsavlsjl7nrlx18i7y4x68u"},{"id":"14mbgdm9zp4xkqin44uulh6kxb","state":"open","txt":"从小动作可看出她对你的爱","pid":"bblukzt6lr2rfm7wfpfsleq1th"},{"id":"3dniem387pp9qleko4q7h1qimx","state":"none","txt":"当你不经意间走过她的身边时，你会发现她的脸突然不自觉\n地红了，那么很可能是因为对你的出现感到紧张。而她之所以感到紧张，正是因为她在乎你。\n一个女人让你从她的于中读出诸如爱情线、命运线以及前世来生等等， 无非是想要与你进行亲密的接触。试想一下，她会让一个毫无好感的男人握住她的于把玩吗\n细心的男人应该能够从女人的小动作、小表情中读懂女人的心理。比如，当某个女人经常目不转睛，仿佛若有所思地看着你的脸时，那就是说，她已深坠爱河而无法自拔了\n而当她对你斜目而视，或四目交投时， 无故婿然微笑，显然证明她心中已经长出爱苗。当她亭亭玉立地站在你面前，下意识地不断摆动玉腿，在地面画线条、打圈子，也是因为心怀爱情。\n每次一定要穿得花枝招展才肯见你的女人，假如偶然在街上碰见\n你的时候，激动得当场要揩手汗，无疑说明她已经在暗中爱上了你。\n假如某个女人不肯正面看你一眼， 或者即使她们肯跟你谈话， 口气也常常支吾其词， 这可不是因为害羞， 而大多是因为对你心存厌恶的表现\n每逢想靠近她的时候， 她老是呈现出不高兴的样子， 想、请你\n赶快离开她， 无疑说明她十分讨庆你。\n当你打算吻她的时候，她置你的热吻和爱抚于不顾， 反而下意识地扭转娇脸，或者背过身躯， 这表示过去的那一段恩情已经寿终正寝。","pid":"14mbgdm9zp4xkqin44uulh6kxb"}]}